
#Область ПрограммныйИнтерфейс

// Добавляет реквизит КонтактноеЛицо на форму программно
// Параметры:
//  Форма - ДокументОбъект - Содержит сам объект базы данных
// 
Процедура ДополнитьФорму(Форма) Экспорт
	
	// ++ Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередПолемОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередПолемСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма);
	КонецЕсли;	
	// -- Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередПолемОснование(Форма)
	
	// ++ Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	ПолеФормы = Форма.Элементы.Вставить("ДК_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Основание);
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеФормы.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	// -- Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередПолемСуммаДокумента(Форма)
	
	// ++ Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	ПолеФормы = Форма.Элементы.Вставить("ДК_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеФормы.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	// -- Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуВГруппаШапкаПраво(Форма)
	
	// ++ Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	ПолеФормы = Форма.Элементы.Добавить("ДК_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеФормы.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	// -- Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	
КонецПроцедуры

#КонецОбласти
