
#Область ПрограммныйИнтерфейс


//Програмное добавление поляФормы на форму документа
//СвойстваЭлемента - структура - свойств добавляемого поля
//ВладелецПоля - владелец добовляемого поля (Форма, группа, ТЧ и.т.п)
Процедура БАЮ_ДобавлениеПоляФормы(СвойстваЭлемента, ВладелецЭлемента,Форма) Экспорт

	Элемент = Форма.Элементы.Добавить(СвойстваЭлемента.Имя,СвойстваЭлемента.Тип,ВладелецЭлемента);
	Элемент.ПутьКДанным = СвойстваЭлемента.ПутьКДанным;
	Элемент.Вид = СвойстваЭлемента.Вид;
	Элемент.Заголовок = СвойстваЭлемента.Заголовок;
     
КонецПроцедуры

Процедура БАЮ_ВтавитьПолеФормы(СвойстваЭлемента,Форма,ПередЭлементом) Экспорт
	
	Элемент = Форма.Элементы.Вставить(СвойстваЭлемента.Имя,СвойстваЭлемента.Тип,
										Форма, ПередЭлементом);
	Элемент.ПутьКДанным = СвойстваЭлемента.ПутьКДанным;
	Элемент.Вид = СвойстваЭлемента.Вид;
	Элемент.Заголовок = СвойстваЭлемента.Заголовок;
КонецПроцедуры  

Процедура БАЮ_ДобавлениеГруппыФормы(СвойстваГруппы,ВладелецГруппы,Форма) Экспорт

   Группа = Форма.Элементы.Добавить(СвойстваГруппы.Имя,СвойстваГруппы.Тип,ВладелецГруппы);
   Группа.Заголовок = СвойстваГруппы.Заголовок;
   Группа.Вид = СвойстваГруппы.Вид;
   Группа.ОтображатьЗаголовок = СвойстваГруппы.ОтображатьЗаголовок;
   Группа.Группировка = СвойстваГруппы.Группировка;

КонецПроцедуры

#КонецОбласти
