
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт
			
	// Вставка "ПоляВвода" "КонтактноеЛицо" в хависимости от формы документа
	Если Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("ДР_КонтактноеЛицо", 
													Тип("ПолеФормы"),,
													Форма.Элементы.Основание); 
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("ДР_КонтактноеЛицо", 
													Тип("ПолеФормы"),,
													Форма.Элементы.СуммаДокумента);													
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" ИЛИ
			Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"ИЛИ
			Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"  Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("ДР_КонтактноеЛицо", 
													Тип("ПолеФормы"), 
													Форма.Элементы.ГруппаШапкаПраво,);
	КонецЕсли;
	
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ДР_КонтактноеЛицо";
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		
КонецПроцедуры

#КонецОбласти
