
#Область ПрограммныйИнтерфейс 


Процедура ДополнитьФорму (Форма) Экспорт 
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Определить вызываемый метод по имени формы 
    ИмяФормы = Форма.ИмяФормы;
    Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"  Тогда 
        ДобавитьПоляНаФормуВГруппаШапкаПраво(Форма);
        ДобавитьПолеНаФормуВГруппаШапкаЛево(Форма);
    ИначеЕсли   ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  
        ДобавитьПоляНаФормуПередОснование(Форма);
    ИначеЕсли   ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  
        ДобавитьПоляНаПередСуммаДокумента(Форма);
    ИначеЕсли   ИмяФормы =  "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
        ДобавитьПоляНаФормуВГруппаШапкаПраво(Форма);
    ИначеЕсли   ИмяФормы =  "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  
        ДобавитьПоляНаФормуВГруппаШапкаПраво(Форма);
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ДобавитьПоляНаФормуВГруппаШапкаПраво(Форма)
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Добавить Контактное лицо на форму в группу ШапкаПраво
    ПолеВвода = Форма.Элементы.Добавить("HW11_КонтактноеЛицо", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво); 
    ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
    ПолеВвода.ПутьКДанным = "Объект.HW11_КонтактноеЛицо";
    
КонецПроцедуры   


Процедура ДобавитьПоляНаФормуПередОснование (Форма)
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Вставить  Контактное лицо на форму после Основание
    
    ПолеВвода = Форма.Элементы.Вставить("HW11_КонтактноеЛицо", Тип("Полеформы"), , Форма.Элементы.Основание); 
    ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
    ПолеВвода.ПутьКДанным = "Объект.HW11_КонтактноеЛицо";
    
КонецПроцедуры 

Процедура ДобавитьПоляНаПередСуммаДокумента(Форма) 
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Вставить  Контактное лицо на форму после СуммаДокумента
    
    ПолеВвода = Форма.Элементы.Вставить("HW11_КонтактноеЛицо", Тип("Полеформы"), , Форма.Элементы.СуммаДокумента); 
    ПолеВвода.Вид = ВидПоляформы.ПолеВвода; 
    ПолеВвода.ПутьКДанным = "Объект.HW11_КонтактноеЛицо";
    
    
КонецПроцедуры  

Процедура ДобавитьПолеНаФормуВГруппаШапкаЛево(Форма)
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Добавить на форму поле HW11_СогласованнаяСкидка 
    //команду ПересчитатьТаблицу и кнопку формы Пересчитать таблицу в группу ШапкаЛево
    
    Если Форма.Элементы.Найти("HW11_СогласованнаяСкидка") = Неопределено Тогда
        НовыйЭлемент = Форма.Элементы.Вставить("HW11_СогласованнаяСкидка", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаЛево);
        НовыйЭлемент.Вид  = ВидПоляформы.ПолеВвода;        
        НовыйЭлемент.ПутьКДанным = "Объект.HW11_СогласованнаяСкидка";
        НовыйЭлемент.УстановитьДействие("ПриИзменении", "HW11_СогласованнаяСкидкаПриИзмененииПосле");
        
        Если Форма.Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда 
            КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
            КомандаПересчитатьТаблицу.Заголовок = "ПересчитатьТаблицу";
            КомандаПересчитатьТаблицу.Действие = "HW11_ПересчитатьТаблицуПосле";
            КомандаПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
            КомандаПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
            
            КнопкаКомандыПересчитать = Форма.Элементы.Вставить("КомандаПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
            КнопкаКомандыПересчитать.ИмяКоманды = "ПересчитатьТаблицу";
            КнопкаКомандыПересчитать.Заголовок = "Пересчитать таблицу";
            КнопкаКомандыПересчитать.Вид = ВидКнопкиФормы.ОбычнаяКнопка;   
            
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры  


#КонецОбласти