
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//++ Каирец А. В. Задача ДЗ 13_7 п. 1 доработка  18.11.2024
	Если Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		
		НовыйЭлемент = Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
		
		НовыйЭлемент.ПутьКДанным = "Объект.ДЗ_13_7_КонтактноеЛицо";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Контактное лицо";
	
	КонецЕсли;
	
	Если Элементы.Найти("ГруппаСкидка") = Неопределено Тогда
		
		НовыйЭлемент2 = Элементы.Вставить("ГруппаСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
		
		НовыйЭлемент2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент2.ОтображатьЗаголовок = Ложь;
		НовыйЭлемент2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Если Элементы.Найти("Скидка") = Неопределено Тогда
			
			НовыйЭлемент3 = Элементы.Вставить("Скидка", Тип("ПолеФормы"), Элементы.ГруппаСкидка);
			
			НовыйЭлемент3.ПутьКДанным = "Объект.ДЗ_13_7_Скидка";
			НовыйЭлемент3.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент3.Заголовок = "Скидка";
			
			//установить действие при изменении
			НовыйЭлемент3.УстановитьДействие("ПриИзменении", "ДЗ_13_7_СкидкаПриИзменении");
			
		КонецЕсли;
		
		//Добавление кнопки команды только если ее нет
		Если Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда
		
			КомандаПересчет = Команды.Добавить("ПересчитатьТаблицу");
			КомандаПересчет.Заголовок = "ПересчитатьТаблицу";
			КомандаПересчет.Действие = "КомандаПересчитатьТаблицу";
			
			КнопкаКоманды = Элементы.Вставить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Элементы.ГруппаСкидка);
			КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
			КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;		
			
		КонецЕсли;	
			
	КонецЕсли;
	//-- Каирец А. В. Задача ДЗ 13_7 п. 1
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_13_7_СкидкаПриИзменении(Элемент)
//++ Каирец А. В. Задача ДЗ 13_7 п.1 Доработка 19.11.2024
//обработка нажатия программно добавленной кнопки
	Если Объект.Услуги.Количество() > 0 Или Объект.Товары.Количество() > 0 Тогда
	
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "Табличную часть документа пересчитать.|Продолжить?";	
		
		Оповещение = Новый ОписаниеОповещения("ДЗ_13_7_ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, Текст, Режим);	
		
	КонецЕсли;
	
//-- Каирец А. В. Задача ДЗ 13_7 п.1
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДЗ_13_7_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
//++ Каирец А. В. Задача ДЗ 13_7 п.1 Доработка 19.11.2024
//обработка выбора пользователя после изменения скидки в шапке документа
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ДЗ_13_7_ПересчитатьТаблицу();	
	
	КонецЕсли;	
// -- Каирец А. В. Задача ДЗ 13_7 п.1
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_13_7_ПересчитатьТаблицу()
//++ Каирец А. В. Задача ДЗ 13_7 п.1 Доработка 19.11.2024
//Расчет построчной суммы табличных частей
	Для каждого СтрУслуги Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(СтрУслуги);
		
	КонецЦикла;
	
	Для Каждого СтрТовары из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(СтрТовары);
		
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
// -- Каирец А. В. Задача ДЗ 13_7 п.1
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//внести здесь изменения
	//++ Каирец А. В. Задача ДЗ 13_7 п.1 Доработка 19.11.2024
	//Изменение механизма расчета скидки с учетом двух ее составляющих
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ОбщаяСкидка = ТекущиеДанные.Скидка + Объект.ДЗ_13_7_Скидка;
	
	Если ОбщаяСкидка > 100 Тогда
		
		ОбщаяСкидка = 100;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Скидка (результатирующая сумма скидок) не может быть больше 100%";
		Сообщение.поле = 
		Элементы.Страницы.ТекущаяСтраница.Заголовок +"[" + (ТекущиеДанные.НомерСтроки-1) + "].Номенклатура";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	КоэффициентСкидки = 1 - ОбщаяСкидка / 100;
	//-- Каирец А. В. Задача ДЗ 13_7 п.1
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
