
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	// {{ Соколов Д.Ю.: Добавление реквизита формы "Д_КонтакноеЛицо" 
		
	
	ПраваяГруппа = Элементы.ГруппаШапкаПраво; 
	ЛеваяГруппа = Элементы.ГруппаШапкаЛево;
	
	ЭлементКонтактноеЛицо = Элементы.Добавить("Д_КонтактноеЛицо", Тип("ПолеФормы"), ПраваяГруппа);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтакноеЛицо";
	
	ЭлементСкидка = Элементы.Добавить("Д_Скидка", Тип("ПолеФормы"), ЛеваяГруппа);
	ЭлементСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСкидка.Заголовок = "Согласованная скикда";
	ЭлементСкидка.ПутьКДанным = "Объект.Д_Скидка";
	ЭлементСкидка.УстановитьДействие("ПриИзменении", "ЭлементСкидкаПриИзменении"); 
	ЭлементСкидка.МаксимальноеЗначение = 100;
	
	КомандаПересчитатьСкидку = Команды.Добавить("Доб_ПересчитатьСкидку");
	КомандаПересчитатьСкидку.Действие = "Доб_ПересчитатьСкидку";
	
	
	ЭлементКнопкаСкидки = Элементы.Добавить("Д_КнопкаСкидка", Тип("КнопкаФормы"), ЛеваяГруппа);
	ЭлементКнопкаСкидки.ИмяКоманды = "Доб_ПересчитатьСкидку";
	ЭлементКнопкаСкидки.Заголовок = "Пересчитать скидку";
	ЭлементКнопкаСкидки.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	
	// Соколов Д.Ю. 06.10.2024 }}

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные) 
	
	// {{ Соколов Д.Ю. 06.10.2024 
	
	// Расчет сумма строки с учетом скидки
	
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * ((100-Объект.Д_Скидка)/100);
	
	// Соколов Д.Ю. 06.10.2024  }}

	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура ЭлементСкидкаПриИзменении(Элемент) 
	
	// {{ Соколов Д.Ю. 06.10.2024 
	
	// При изменении поля скидка 
	
	ЭлементСкидкаПриИзмененииПередАсинх(Элемент)
	
	// Соколов Д.Ю. 06.10.2024  }}
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЭлементСкидкаПриИзмененииПередАсинх(Элемент) 
	
	// {{ Соколов Д.Ю. 06.10.2024 
	// Вывод вопроса для пользователя об пересчете скидки
	
	Если Элементы.Товары.ТекущиеДанные <> Неопределено ИЛИ Элементы.Товары.ТекущиеДанные <> Неопределено Тогда
		
		ТекстВопроса = "Изменить процент скидки? Пересчитать таблицы товаров и услуг?";
		ВариантОтвета = Новый СписокЗначений;
		ВариантОтвета.Добавить(1, "Да");
		ВариантОтвета.Добавить(2, "Нет");
		
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантОтвета);
		
		Если ОтветПользователя = 1 Тогда
			
			ПересчетСкидки();
			
		КонецЕсли  	
		
	КонецЕсли;
	
	// Соколов Д.Ю. 06.10.2024  }}
	
КонецПроцедуры   

&НаКлиенте
Процедура Доб_ПересчитатьСкидку(Команда)
	
	// {{ Соколов Д.Ю. 06.10.2024 
	// Обработка нажатия кнопки ПересчитатьСкидку
	
	ПересчетСкидки()
	
	// Соколов Д.Ю. 06.10.2024  }} 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчетСкидки()
	
	// {{ Соколов Д.Ю. 06.10.2024 
	
	// Процедура пересчета скидки и таблицах Товары и Услуги
	
	Для Каждого ТД Из Объект.Товары Цикл  
		
		РассчитатьСуммуСтроки(ТД)
		
	КонецЦикла;
	
	Для Каждого ТД Из Объект.Услуги Цикл  
		
		РассчитатьСуммуСтроки(ТД)
		
	КонецЦикла;
	
	// Соколов Д.Ю. 06.10.2024  }}
	
КонецПроцедуры


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
