
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
     
   КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)  
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 Рассчитывать сумму с учетом HW11_СогласованнаяСкидка 
    //Исходный код:
    //ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
    //Новый код:    
    ТекущиеДанные.Сумма =  (ТекущиеДанные.Цена * ТекущиеДанные.Количество) -  (ТекущиеДанные.Цена * ТекущиеДанные.Количество) * (Объект.HW11_СогласованнаяСкидка/100);
    //КонецДоработки
    РассчитатьСуммуДокумента();
    
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
    
    Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
    
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ДоработкаДЗ11


&НаКлиенте   
Процедура HW11_ПересчитатьТаблицуПосле();
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 вызов типового метода ПересчетТаблицыПриИзмененииПроцентаСкидки 
    ПересчетТаблицыПриИзмененииПроцентаСкидки();
    
КонецПроцедуры

&НаКлиенте
Процедура HW11_СогласованнаяСкидкаПриИзмененииПосле(Элемент)
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 
    //Проверка содержания таблиц и вызов пересчета при наличии данных в таблице
    
    Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    
    ПриИзмененииПроцентаСкидки();
    
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриИзмененииПроцентаСкидки()
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 
    //Ждать ответа пользователя, при Да - пересчитать таблицы, Нет - возврат 
    
    ТекстВопроса = "Изменен процент скидки. Пересчитать таблицы товаров и услуг?";
    ВариантДействия = Новый СписокЗначений;
    ВариантДействия.Добавить(1, "Да");
    ВариантДействия.Добавить(2, "Нет"); 
    
    ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантДействия);   
    
    Если ОтветПользователя = 1 Тогда
        ПересчетТаблицыПриИзмененииПроцентаСкидки();
    Иначе  
        Возврат;
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура ПересчетТаблицыПриИзмененииПроцентаСкидки()
    //НачалоДоработки 
    //Казаков М.Н. homework-11-2  12.03.2025 
    //Вызвать метод РассчитатьСуммуСтроки для таблиц Товар, Услуга
    
    Для Каждого Товар из  Объект.Товары Цикл
        РассчитатьСуммуСтроки(Товар);
    КонецЦикла;
    
    Для Каждого Услуга  из  Объект.Услуги Цикл
        РассчитатьСуммуСтроки(Услуга);
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти