#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	// ++Краковный Задача ____ 06.07.2024
	Если Элементы.Найти("Скидка") = Неопределено Тогда
		
		ПолеВвода = Элементы.Вставить("Скидка", Тип("ПолеФормы"), Элементы.ГруппаСкидки);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 	  
		ПолеВвода.ПутьКДанным = "Объект.НК_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "НК_СогласованнаяСкидкаПриИзменении");	
		
	КонецЕсли;
	
	// --Краковный Задача ____ 06.07.2024
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
    // ++Краковный Задача ____ 06.07.2024
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат; 
		
	Иначе
		
		Для каждого Строка Из Объект.Товары Цикл
			
			Строка.Сумма = Строка.Цена * Строка.Количество * (1 - объект.НК_СогласованнаяСкидка/100);
			
		КонецЦикла;
		
		Для каждого Услуга Из Объект.Услуги Цикл
			
			Услуга.Сумма = Услуга.Цена * Услуга.Количество * (1 - Объект.НК_СогласованнаяСкидка/100); 
			
		КонецЦикла;
		
	КонецЕсли;
	// --Краковный Задача ____ 06.07.2024
КонецПроцедуры
  
  &НаКлиенте
Процедура НК_СогласованнаяСкидкаПриИзменении(Элемент)
	// ++Краковный Задача ____ 06.07.2024
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Пересчитать таблицы?'"), Режим, 0);
	
	// --Краковный Задача ____ 06.07.2024
КонецПроцедуры


 &НаКлиенте
 Процедура НК_РассчитатьСкидку()
	 // ++Краковный Задача ____ 11.05.2024	 
	 
	 Для каждого Строка Из Объект.Товары Цикл
		 
		 Строка.Сумма = Строка.Цена * Строка.Количество * (1 - объект.НК_СогласованнаяСкидка/100);
		 
	 КонецЦикла;
	 
	 Для каждого Услуга Из Объект.Услуги Цикл
		 
		 Услуга.Сумма = Услуга.Цена * Услуга.Количество * (1 - Объект.НК_СогласованнаяСкидка/100);
		 
		 РассчитатьСуммуДокумента();  
		 
	 КонецЦикла;
	 // --Краковный Задача ____ 11.05.2024
 КонецПроцедуры
 

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	// ++Краковный Задача ____ 07.05.2024
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * (1 - Объект.НК_СогласованнаяСкидка/100);

	
	// --Краковный Задача ____ 07.05.2024
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
