
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
		//++ Доработка Егоров Задание 1 от 16.01.2025 Добавление реквизита Фоормы КонтактноеЛицо
	Если Элементы.Найти("КЛ_КонтактноеЛицо") = Неопределено Тогда
	
		//Добавление поля ввода
		
        ЭлементКЛ_КонтактныеЛица = Элементы.Добавить("КЛ_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево); 
		ЭлементКЛ_КонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКЛ_КонтактныеЛица.ПутьКДанным = "Объект.КЛ_КонтактноеЛицо";

	КонецЕсли;
	
	//-- Доработка Егоров Задание 1 от 16.01.2025 Добавление реквизита Формы КонтактноеЛицо
	
	//++ Доработка Егоров Задание 2 от 16.01.2025 Добавление реквизита Формы КЛ_СогласованнаяСкидка
	Если Элементы.Найти("КЛ_СогласованнаяСкидка") = Неопределено Тогда
		//Добавление поля ввода
		
		ЭлементКЛ_СогласованнаяСкидка = Элементы.Добавить("КЛ_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево); 
		ЭлементКЛ_СогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементКЛ_СогласованнаяСкидка.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка";
		ЭлементКЛ_СогласованнаяСкидка.УстановитьДействие("ПриИзменении","КЛ_СогласованнаяСкидкаПриИзмененииПосле");
	КонецЕсли;
	
	
	Если Элементы.Найти("КнопкаПересчитатьСкидку") = Неопределено Тогда
		//Добавим команду в коллекцию команд 
		КомандаПересчитатьСкидку = Команды.Добавить("ПересчитатьСкидку");
		КомандаПересчитатьСкидку.Заголовок = "Пересчитать Скидку";
		КомандаПересчитатьСкидку.Действие = "КЛ_ПересчитатьСкидку";
		
		//Добавление поля ввода
		
		КнопкаКоманды = Элементы.Добавить("КнопкаПересчитатьСкидку", Тип("КнопкаФормы"), Элементы.ГруппаШапкаЛево); 
		КнопкаКоманды.ИмяКоманды = "ПересчитатьСкидку";
		Элементы.КнопкаПересчитатьСкидку.Картинка = БиблиотекаКартинок.Обновить;
		Элементы.КнопкаПересчитатьСкидку.Отображение = ОтображениеКнопки.КартинкаИТекст;
				
	КонецЕсли;  
	//-- Доработка Егоров Задание 2 от 18.11.2024 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку"
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

//++ Доработка Егоров Задание 2 от 18.11.2024 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку" 
&НаКлиенте
Процедура КЛ_ПересчитатьСкидку()
	Если Не (Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0) Тогда
		КЛ_ПересчитатьСкидкуПослеФрагмент();
	Иначе
		Сообщить("Данные таблицы не заполнены");
	КонецЕсли	
КонецПроцедуры


&НаКлиенте
Процедура КЛ_СогласованнаяСкидкаПриИзмененииПосле(Элемент)
	ДиалогВыбораСкидкиАсинх();
КонецПроцедуры

	//-- Доработка Егоров Задание 2 от 18.11.2024 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку" 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//++ Доработка Егоров Задание 2 от 16.01.2025 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку"
	//Заменяем Строки:
	//	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	 //На:
	 ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * (100 - Объект.КЛ_СогласованнаяСкидка) / 100;
	 РассчитатьСуммуДокумента();
	 //-- Доработка Егоров Задание 2 от 16.01.2025 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку"
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры
//++ Доработка Егоров Задание 2 от 18.11.2024 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку"
&НаКлиенте
Асинх Процедура ДиалогВыбораСкидкиАсинх()
	Если Не (Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0) Тогда
		
		ВопросОПересчете = ВопросАсинх("Производить пересчет скидки?", РежимДиалогаВопрос.ДаНет);
		ОтветНаВопрос = Ждать ВопросОПересчете;
		Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда			
			КЛ_ПересчитатьСкидкуПослеФрагмент();			
		Иначе 
			Сообщить("Не Пересчитываем");
		КонецЕсли;
	Иначе
		Сообщить("Данные таблицы не заполнены");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КЛ_ПересчитатьСкидкуПослеФрагмент()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(ТекущаяСтрока); 
	КонецЦикла; 
	
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(ТекущаяСтрока); 
	КонецЦикла; 
	
КонецПроцедуры 

	//-- Доработка Егоров Задание 2 от 18.11.2024 Добавление реквизита Формы Кнопка/Команда "Пересчитать скидку" 



#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
