
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	// ++ Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.Ссылка.ДействуетНаОснование) Тогда
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.Ссылка.ДействуетНаОснование);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	// -- Алькин В.А. Задание к занятию Внесение изменений в конфигурацию на поддержке, Задача 1 от 05.10.2024
	
КонецПроцедуры

#КонецОбласти