
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// ++ Купцов Задача ДК_Доработка 13/09/24
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	// --
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	// ++ Купцов Задача ДК_Доработка 13/09/24
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = Данные.Наименование +"(на осн. "+ Данные.ДействуетНаОсновании + ")";
	Иначе
		Представление = Данные.Наименование;	
	КонецЕсли;
	// --	
КонецПроцедуры
