#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		ШаблонПредставления = НСтр("ru = '%1 (на осн. %2)'");
		Представление = СтрШаблон(ШаблонПредставления, Данные.Наименование, Данные.ДействуетНаОсновании);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
