
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			"Ссылка, Договор, Комментарий, Контрагент, Организация, Ответственный, Товары");
			
		Договор = ЗначенияРеквизитов.Договор;
		Комментарий = ЗначенияРеквизитов.Комментарий;
		Контрагент = ЗначенияРеквизитов.Контрагент;
		Организация = ЗначенияРеквизитов.Организация;
		Ответственный = ЗначенияРеквизитов.Ответственный;
		Основание = ЗначенияРеквизитов.Ссылка;
		
		Для Каждого ТекСтрокаТовары Из ЗначенияРеквизитов.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
