Процедура ДополнитьФорму(Форма) Экспорт
     
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли	
		ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВФорма(Форма); 
	ИначеЕсли	
		ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВФорма(Форма);
	ИначеЕсли	
		ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли	
		ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма)
	// ++Красова Задача №1 , 30.06.2024
	ЭлементКонтактноеЛицо = Форма.Элементы.Вставить("Д_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво, Форма.Элементы.Договор);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ЭлементКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	// --  
КонецПроцедуры // ДобавитьКонтактноеЛицоВГруппаШапкаПраво()

Процедура ДобавитьКонтактноеЛицоВФорма(Форма)
	// ++Красова Задача №1 , 30.06.2024
	ЭлементКонтактноеЛицо = Форма.Элементы.Вставить("Д_КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Договор);
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.Д_КонтактноеЛицо";
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	ЭлементКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	// --  
КонецПроцедуры // ДобавитьКонтактноеЛицоВФорма() 
