#Область Доработка

//{{ Доработка представления справочника Контактные лица

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Тум_ДействуетНаОсновании");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если Данные.Тум_ДействуетНаОсновании <> "" Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Наименование + " (на осн. " + Данные.Тум_ДействуетНаОсновании + ")";
	КонецЕсли;
КонецПроцедуры

//}} КонецДоработки
#КонецОбласти