
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = Данные.Наименование + " (на осн. " + Данные.ДействуетНаОсновании + ")";	
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
