
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФИО = Данные.Наименование;
	
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Основание = СтрШаблон(" (на осн %1)", Данные.ДействуетНаОсновании);
	КонецЕсли;
	
	Представление = СтрШаблон("%1 %2", ФИО, Основание);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли