  
 Процедура ДополнитьФорму(Форма) Экспорт  
	 
 //Начало Питенко М.В.
 //Процедуры дополняют формы документов полем Контактное лиц
	 
	 ИмяФормы = Форма.ИмяФормы;
	 
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	 ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	 ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	 ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 ВставитьПолеКонтактноеЛицоНаФормуПередОснование (Форма); 
	 ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента (Форма);
	 КонецЕсли;          
	 
 //Окончание Питенко М.В.  
 
 КонецПроцедуры
 
 
 
 Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма)
	 
 //Начало Питенко М.В.
	 
	 ПолеВвода = Форма.Элементы.Добавить ("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.МП_КонтактноеЛицо"; 
	 
 //Окончание Питенко М.В.
	 
 КонецПроцедуры 
 
 
 
  
 Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента (Форма) 
	 
 //Начало Питенко М.В.

	 
	 ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", Тип ("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.МП_КонтактноеЛицо";
	 
 //Окончпние Питенко М.В.
 
	 
 КонецПроцедуры 
 
  
 Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование (Форма)
	 
	 //Начало Питенко М.В.

	 ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", Тип ("ПолеФормы"), , Форма.Элементы.Основание);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.МП_КонтактноеЛицо";  
	 
	 //Окончание Питенко М.В.

	 
 КонецПроцедуры
 