Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	Если СтрЗаканчиваетсяНа(ИмяФормы, "ФормаДокумента") Тогда
		
		ДобавитьПолеКонтактноеЛицо(Форма);
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицо(Форма)
	
	ИмяДокумента = СтрРазделить(Форма.ИмяФормы, ".")[1];
		
	Если ИмяДокумента = "ЗаказПокупателя" Или 
		ИмяДокумента = "ПоступлениеТоваровУслуг" Или 
			ИмяДокумента = "РеализацияТоваровУслуг" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Добавить("юб_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ИначеЕсли ИмяДокумента = "ОплатаОтПокупателя" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("юб_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.Основание);
	ИначеЕсли ИмяДокумента = "ОплатаПоставщику" Тогда
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("юб_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	Иначе
		Возврат;
	КонецЕсли;
	
	ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеКонтактноеЛицо.ПутьКДанным = "Объект.юб_КонтактноеЛицо";
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	Форма.Элементы.юб_КонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	
КонецПроцедуры 

  


























