#Область ПрограммныйИнтерфейс 

процедура ДополнитьФормы(Форма) Экспорт
	
	//Какую Форму дополняем
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаВПраво(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуНадПолемСуммаДокумента(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуНадПолемСуммаДокумента(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаВПраво(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаВПраво(Форма);
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеСогласованнаяСкидкаИКомандаПересчитать(Форма)
	
	//Добавляем группу для элементов скидка и кнопка пересчитать.
	ГруппаФормы = Форма.Элементы.Добавить("ГруппаСкидка",Тип("ГруппаФормы"),Форма.Элементы.ГруппаНомерДата);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;		
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
    //Добавляем поле на форму и помещем в группу скидки
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
	//Создаем команду для форме
	Команда = Форма.Команды.Добавить("Пересчитать");
	Команда.Заголовок = "Пересчитать";
	Команда.Действие = "ПересчитатьТаблицуСоСкидкой";
	// Выносим команду на форму в виде кномки обычной и помещаем в группу скидки
	КнопкаФормы = Форма.Элементы.Добавить("Пересчитать",Тип("КнопкаФормы"),Форма.Элементы.ГруппаСкидка); 
	КнопкаФормы.ИмяКоманды = "Пересчитать";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//вызываем процедуру установки действия При
	ДобавитьОбработчикДействииДляПоляСогласованаяСкидка(Форма);

КонецПроцедуры

Процедура ДобавитьОбработчикДействииДляПоляСогласованаяСкидка(Форма) 
	// Устанавливаем для поля согласованная скидка  действие при изменении значения в поле
	// переопределяем названия процедуры или функции.
	Форма.Элементы.СогласованнаяСкидка.УстановитьДействие("ПриИзменении","СогласованнаяСкидкаПриИзменении");   
	
Конецпроцедуры



Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаВПраво(Форма)
	
	// На Форму добовляем поле контатное лицо 
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	//Если Форма документа заказ покупателя 
	//вызываем процедуру добовления поля согласованная скидка и кнопку пересчитать табличные данные.
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеСогласованнаяСкидкаИКомандаПересчитать(Форма);
    КонецЕсли;
	

КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуНадПолемСуммаДокумента(Форма)
	// Вставляем поля для реквезита "контактное лицо" перед полем реквезита "сумма документа".
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	
КонецПроцедуры 

  #КонецОбласти
