
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
КонецПроцедуры


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = СтрШаблон("%1 на осн.%2",Данные.Наименование,Данные.ДействуетНаОсновании);
	Иначе 
		Представление = Данные.Наименование 
	КонецЕсли;
КонецПроцедуры 

