#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда 
		Представление = Данные.Наименование + "(На основании:" + Данные.ДействуетНаОсновании + ")"; 
	КонецЕсли
КонецПроцедуры
 
#КонецОбласти  
#КонецЕсли
