	  
	  Процедура ДополнитьФорму(Форма) Экспорт 
		  
		  //+Попов Сергей Александрович, 19.11.24
		  //Добавляем документы в которые вставляем поле "КонтактноеЛицо"
		  ИмяФормы = Форма.ИмяФормы;
		  
		  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
			  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		  ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
			  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		  ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		  ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
			  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		  ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
			  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 
		  КонецЕсли; 
		  //-Попов Сергей Александрович, 19.11.24
		  
		  //+Попов Сергей Александрович, 19.11.24
		  //Добавляем в документ ЗаказПокупателя поле формы СогласованнаяСкидка и кнопку формы ПересчитатьТаблицу
		  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
			  ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПравоГруппаСкидкаКоманда(Форма);
		  КонецЕсли;
		  
		  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
			  ДобавитьКомандуПересчитатьТаблицу(Форма);
		  КонецЕсли;
		  
		  
	  КонецПроцедуры 
	  
	  Процедура   ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
		  
		  //+Попов Сергей Александрович, 19.11.24
		  //Добавляем КонтактноеЛицо в Форму
		  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.Дор_КонтактноеЛицо";
		  
	  КонецПроцедуры  
	  
	  Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
		  //+Попов Сергей Александрович, 19.11.24
		  //Вставляем КонтактноеЛицо в Форму
		  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.Дор_КонтактноеЛицо";
		  
	  КонецПроцедуры  
	  
	  Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПравоГруппаСкидкаКоманда(Форма); 
		  //+Попов Сергей Александрович, 19.11.24
		  //Добавляем в документ ЗаказПокупателя поле СогласованнаяСкидка 
		  ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидкаКоманда);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.Дор_СогласованнаяСкидка";
		  ПолеВвода.УстановитьДействие("ПриИзменении", "Дор_СогласованнаяСкидкаПриИзменении");
		  		  
	  КонецПроцедуры  
	  
	  Процедура ДобавитьКомандуПересчитатьТаблицу(Форма);
		  //+Попов Сергей Александрович, 19.11.24
		  //Добавляем в документ ЗаказПокупателя кнопку формы ПересчитатьТаблицу
		  КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"),  Форма.Элементы.ГруппаСкидкаКоманда);
		  КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
		  КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;	  
		  
	  КонецПроцедуры  
	  
