#Область Дополнения
  
  Процедура НК_Дополнение(Форма) Экспорт
   // ++Краковный Задача ____ 06.07.2024
   ИмяФормы = Форма.ИмяФормы; 
   
   Если  ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
	   НК_ДобавитьКонтактноеЛицоВРеализацияТоваровУслуг(Форма); 
	   НК_ДобавитьЭлементСогласованнаяСкидка(Форма);
	   
   ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда	
	   НК_ДобавитьКонтактноеЛицоВОплатаОтПокупателя(Форма);
	   
   ИначеЕсли ИмяФормы =  "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда	
	   НК_ДобавитьКонтактноеЛицоВОплатаПоставщику(Форма);
	   
   ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда	
	   НК_ДобавитьКонтактноеЛицоВРеализацияТоваровУслуг(Форма);
	   
   ИначеЕсли  ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда	
	   НК_ДобавитьКонтактноеЛицоВРеализацияТоваровУслуг(Форма);
	   
   КонецЕсли;
   // --Краковный Задача ____ 06.07.2024
 КонецПроцедуры 

  Процедура НК_ДобавитьКонтактноеЛицоВОплатаОтПокупателя(Форма)
 // ++Краковный Задача ____ 06.07.2024
 Если Форма.Элементы.Найти("НК_КонтактноеЛицо") = Неопределено Тогда
	 
	 СледующийЭлемент = Форма.Элементы.Найти("Основание");
	 
	 ПолеВвода = Форма.Элементы.Вставить("НК_КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 	  
	 ПолеВвода.ПутьКДанным = "Объект.НК_КонтактноеЛицо";
	 ПолеВвода.Заголовок = "Контактное лицо";
	 
 КонецЕсли;
 // --Краковный Задача ____ 06.07.2024
КонецПроцедуры
 
  Процедура НК_ДобавитьКонтактноеЛицоВОплатаПоставщику(Форма)
  // ++Краковный Задача ____ 06.07.2024
  Если Форма.Элементы.Найти("НК_КонтактноеЛицо") = Неопределено Тогда 
	  
	  СледующийЭлемент = Форма.Элементы.Найти("СуммаДокумента");
	  
	  ПолеВвода = Форма.Элементы.Вставить("НК_КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 	  
	  ПолеВвода.ПутьКДанным = "Объект.НК_КонтактноеЛицо";
	  ПолеВвода.Заголовок = "Контактное лицо";
  КонецЕсли;
  // --Краковный Задача ____ 06.07.2024
 КонецПроцедуры
 
  Процедура НК_ДобавитьКонтактноеЛицоВРеализацияТоваровУслуг(Форма)
// ++Краковный Задача ____ 06.07.2024	 
Если Форма.Элементы.Найти("НК_КонтактноеЛицо") = Неопределено Тогда 
	
	 СледующийЭлемент = Форма.Элементы.Найти("Основание");
	 
	 ПолеВвода = Форма.Элементы.Вставить("НК_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 	  
	 ПолеВвода.ПутьКДанным = "Объект.НК_КонтактноеЛицо";
	 ПолеВвода.Заголовок = "Контактное лицо";	
	
КонецЕсли;		
// --Краковный Задача ____ 06.07.2024
 КонецПроцедуры
 
  Процедура НК_ДобавитьЭлементСогласованнаяСкидка(Форма)
	// ++Краковный Задача ____ 06.07.2024  
	  СледующийЭлемент = Форма.Элементы.Найти("Страницы"); 
	  //Создание группы
	  Если Форма.Элементы.Найти("ГруппаСкидки") = Неопределено Тогда
		  
	ГруппаСкидки = Форма.Элементы.Вставить("ГруппаСкидки", Тип("ГруппаФормы"),Форма,СледующийЭлемент);
	ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСкидки.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	КонецЕсли;
	
	//Создание команды
	Если Форма.Элементы.Найти("НК_РассчитатьСкидку") = Неопределено Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("РассчитатьСкидку");
		НоваяКоманда.Действие = "НК_РассчитатьСкидку";
		НоваяКнопка = Форма.Элементы.Вставить("РассчитатьСкидку", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидки);
		НоваяКнопка.ИмяКоманды = "РассчитатьСкидку";
		НоваяКнопка.Заголовок = "Рассчитать скидку";
		
	КонецЕсли; 
	// --Краковный Задача ____ 06.07.2024	  		  
  КонецПроцедуры
  
#КонецОбласти