
Процедура ДополнитьФорму(Форма) Экспорт 
	
	//++ Добавление элементов формы 23.10.2024 г. Соколов А.А.
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьЭлементыИКнопкиФормыЗаказаПокупателя(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма);  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма);   
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)		
	КонецЕсли;
	//--
	
КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицоГруппаШапкаПраво(Форма)
	
	//++ Добавление элемента формы 23.10.2024 г. Соколов А.А. 
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
		
	КонецЕсли;
	//--
	
КонецПроцедуры     

Процедура ДобавитьПолеСогласованнаяСкидкаГруппаШапкаЛево(Форма)
	
	//++ Добавление элемента формы 23.10.2024 г. Соколов А.А. 
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		
		ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
		
	КонецЕсли;
	//--
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) 
	
	//++ Вставка элемента формы 23.10.2024 г. Соколов А.А.
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		
		ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"; 
		
	КонецЕсли;
	//--
	
КонецПроцедуры

Процедура ДобавитьЭлементыИКнопкиФормыЗаказаПокупателя(Форма);
	
	//++ Добавление элемента и кнопки в формы 23.10.2024 г. Соколов А.А.
	Если Форма.Элементы.Найти("ГруппаКонтактноеЛицоИСкидка") = Неопределено Тогда
		
		ГруппаФормы = Форма.Элементы.Вставить("ГруппаКонтактноеЛицоИСкидка", Тип("ГруппаФормы"),, Форма.Элементы.Страницы);
		ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
		ГруппаФормы.Видимость = Истина;
		
	КонецЕсли;
	
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
		
	КонецЕсли;
	
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		
		ПолеВвода = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаКонтактноеЛицоИСкидка); 
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
		
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда  
		
		КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
		КомандаПересчитатьТаблицу.Действие = "ПересчитатьТаблицу";
		
		КнопкаКоманды = Форма.Элементы.Вставить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаКонтактноеЛицоИСкидка);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
		КнопкаКоманды.Заголовок = "Пересчитать таблицы";
		КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
		
	КонецЕсли; 
	//--	 
	
КонецПроцедуры   

