
#Область ПрограммныйИнтерфейс

// Выводит дополнительные реквизиты и команды на форму.
// Для вызова из обработчика формы ПриСозданииНаСервере.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо добавить элементы.
//
Процедура ДополнитьФорму(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет элемент КонтактноеЛицо на форму в группу ГруппаШапкаПраво.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо добавить элементы.
//
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)

	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_13_7_КонтактноеЛицо";

КонецПроцедуры

// Вставляет элемент КонтактноеЛицо на форму перед элементом СуммаДокумента.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо добавить элементы.
//
Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)

	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_13_7_КонтактноеЛицо";

КонецПроцедуры

#КонецОбласти
