
#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДействуетНаОсновании) Тогда 
		ПредставлениеКонтактногоЛица = СтрШаблон("%1, действует на основании %2", Объект.Наименование, Объект.ДействуетНаОсновании);	
		Объект.ПредставлениеКЛ = ПредставлениеКонтактногоЛица;
	Иначе
		Объект.ПредставлениеКЛ = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетНаОснованииПриИзменении(Элемент)

	ПредставлениеКонтактногоЛица = СтрШаблон("%1, действует на основании %2", Объект.Наименование, Объект.ДействуетНаОсновании);	
	Объект.ПредставлениеКЛ = ПредставлениеКонтактногоЛица; 
	
КонецПроцедуры   



#КонецОбласти
