
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоНаФормуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;
	
КонецПроцедуры	


Процедура ДобавитьКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
    ПолеВвода.ПутьКДанным = "Объект.HW_11_2_КонтактноеЛицо";
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;	
	
КонецПроцедуры


Процедура ДобавитьКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
    ПолеВвода.ПутьКДанным = "Объект.HW_11_2_КонтактноеЛицо";
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;	
	
КонецПроцедуры

Процедура ДобавитьКонтактноеЛицоНаФормуПередОснование(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Основание);
    ПолеВвода.ПутьКДанным = "Объект.HW_11_2_КонтактноеЛицо";
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;	
	
КонецПроцедуры


Процедура ДобавитьСогласованнаяСкидкаВГруппуСкидка(Форма) Экспорт

	// Добавляем группу "Скидка"
	ГруппаСкидка = Форма.Элементы.Добавить("Скидка", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаПраво);
    ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
    ГруппаСкидка.ОтображатьЗаголовок = Ложь;
    ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	// Выводим реквизит "СогласованнаяСкидка"
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСкидка);
    ПолеВвода.ПутьКДанным = "Объект.HW_11_2_СогласованнаяСкидка";
    ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнойСкидки");
	
	// Добавляем Команду "ПересчетСуммСУчетомСкидки"
	Команда = Форма.Команды.Добавить("ПересчетСуммСУчетомСкидки");
	Команда.Действие = "КомандаПересчетСуммСУчетомСкидки";
	
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчетСуммСУчетомСкидки", Тип("КнопкаФормы"), ГруппаСкидка);
	КнопкаФормы.ИмяКоманды = "ПересчетСуммСУчетомСкидки";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Заголовок = "Пересчет сумм";
	
КонецПроцедуры


