#Область СлужебныеПроцедурыИФункции
Процедура ОтрисоватьДопЭлементыФорм(Форма)Экспорт  
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ПолеКонтактноеЛицо = Форма.Элементы.Добавить("ак_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
		ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;	
		ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ак_КонтактноеЛицо";
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда   
		
		ПолеКонтактноеЛицо = Форма.Элементы.Добавить("ак_КонтактноеЛицо", Тип("ПолеФормы"), Форма);
		ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;	
		ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ак_КонтактноеЛицо"; 
		
		Если ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
			Форма.Элементы.Переместить(ПолеКонтактноеЛицо, Форма, Форма.Элементы.Основание);
		ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
			Форма.Элементы.Переместить(ПолеКонтактноеЛицо, Форма, Форма.Элементы.СуммаДокумента);
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
