#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт 

	//Сморгун А.В. Процедура доработки формы
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" ИЛИ 
		ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента"	Тогда 
		
		ДобавитьПолеПередСуммойДокумента(Форма);
		
	ИначеЕсли 
		
		ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" ИЛИ
		ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеВГруппаШапкаПраво(Форма);
		
	ИначеЕсли 
		
		ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеВГруппаШапкаПраво(Форма);
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеВГруппаШапкаПраво(Форма)
	
	//Сморгун А.В. Добавление поля Контактное лицо в документы Поступления, реализации и заказа
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";	
	
КонецПроцедуры

Процедура ДобавитьПолеПередСуммойДокумента(Форма)

	//Сморгун А.В. Добавление поля Контактное лицо в документы Оплаты

 	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";	
	
КонецПроцедуры

#КонецОбласти